package cn.com.clm.util;

import java.util.HashMap;
import java.util.Iterator;
import java.util.Map;
import java.util.Map.Entry;

public class CityId {
	
	public final static Map<String,String> map = new HashMap<String, String>() {
		private static final long serialVersionUID = 1L;

	{  
	    put("兰州", "101160101");  
	    put("定西", "101160201");  
	    put("临洮", "101160205");  
	    put("北京", "101010100");  
	    put("皋兰", "101160102");  
	    put("永登", "101160103");  
	    put("榆中", "101160104");  
	    put("通渭", "101160202");  
	    put("陇西", "101160203");  
	    put("渭源", "101160204");  
	    put("漳县", "101160206");  
	    put("岷县", "101160207");  
	    put("安定", "101160208");  
	    put("平凉", "101160301");  
	    put("泾川", "101160302");  
	    put("灵台", "101160303");  
	    put("崇信", "101160304");  
	    put("华亭", "101160305");  
	    put("庄浪", "101160306");  
	    put("静宁", "101160307");  
	    put("崆峒", "101160308");  
	    put("庆阳", "101160401");  
	    put("西峰", "101160402");  
	    put("环县", "101160403");  
	    put("华池", "101160403");  
	    put("合水", "101160405");  
	    put("正宁", "101160406");  
	    put("宁县", "101160407");  
	    put("北京", "101160408");  
	    put("镇原", "101010100");
	    put("庆城", "101160409");
	    put("武威", "101160501");
	    put("民勤", "101160502");
	    put("古浪", "101160503");
	    put("乌鞘岭", "101160504");
	    put("天祝", "101160505");
	    put("金昌", "101160601");
	    put("永昌", "101160602");
	    put("张掖", "101160701");
	    put("肃南", "101160702");
	    put("民乐", "101160703");
	    put("临泽", "101160704");
	    put("高台", "101160705");
	    put("山丹", "101160706");
	    put("酒泉", "101160801");
	    put("鼎新", "101160802");
	    put("金塔", "101160803");
	    put("马鬃山", "101160804");
	    put("瓜州", "101160805");
	    put("肃北", "101160806");
	    put("玉门", "101160807");
	    put("敦煌", "101160808");
	    put("天水", "101160901");
	    put("北道区", "101160902");
	    put("秦安", "101160904");
	    put("清水", "101160903");
	    put("甘谷", "101160905");
	    put("武山", "101160906");
	    put("张家川", "101160907");
	    put("麦积", "101160908");
	    put("武都", "101161001");
	    put("文县", "101161003");
	    put("宕昌", "101161004");
	    put("康县", "101161005");
	    put("西和", "101161006");
	    put("礼县", "101161007");
	    put("徽县", "101161008");
	    put("两当", "101161009");
	    put("临夏", "101161101");
	    put("康乐", "101161102");
	    put("永靖", "101161004");
	    put("宕昌", "101161103");
	    put("广河", "101161104");
	    put("和政", "101161104");
	    put("广河", "101161105");
	    put("和政", "101161106");
	    put("合作", "101161201");
	    put("临潭", "101161202");
	    put("卓尼", "101161203");
	    put("舟曲", "101161204");
	    put("迭部", "101161205");
	    put("玛曲", "101161206");
	    put("碌曲", "101161207");
	    put("夏河", "101161208");
	    put("白银", "101161301");
	    put("靖远", "101161302");
	    put("会宁", "101161303");
	    put("华家岭", "101161304");
	    put("景泰", "101161305");
	    
	}};
	
	public static String getCityId(String city){
		Map<String,String> cityMap = CityId.map;
		Iterator i = map.entrySet().iterator();
		String cityID = null;
		while (i.hasNext()) {
			Entry entry = (java.util.Map.Entry)i.next();
			String cityName = String.valueOf(entry.getKey());
			if(city.equals(cityName)){
				cityID = String.valueOf(entry.getValue());
			}
		}
		return cityID;
	}
	

}
